# Задание 3

n = int(input("Введите число от 1 до 9: "))

a = n * 10
b = n * 100
c = n + (n + a) + (n + a + b)

print("%d" % c)

# вариант
# n = int(input("Введите число от 1 до 9: "))
#
# a = n * 11
# b = n * 111
# c = n + a + b
#
# print("%d" % c)