# Задание 1

# пункт 1 - переменная для теста по математике
# simple = int(input("Введите любое простое число в диапазоне от 0 до 9: "))
#
# if simple == 1 or simple == 3 or simple == 5 or simple == 7:
#     print("Это правильный ответ!")

# пункт 2 - переменная для покупки валюты
# dollars = int(input("Введите сумму в долларах: "))
# exchange_rate = 80
# rubles = dollars * exchange_rate
# print("Требуемая сумма в рублях -", rubles)

# пункт 3 - переменные для сообщения
# firstname = input("Введите своё имя: ")
# patronymic = input("Введите своё отчество: ")
# surname = input("Введите свою фамилию: ")
# e_mail = input("Введите адрес вашей электронной почты: ")
# print("Уважаемый",firstname,patronymic,surname,"!", "На указанный Вами адрес", e_mail, "отправлено письмо с ссылкой для подтверждения регистрации!" )
